Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>libp2p</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository_collaborator.this["universal-connectivity:go-libp2p maintainers"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "maintain"
      + permission_diff_suppression = false
      + repository                  = "universal-connectivity"
      + username                    = "go-libp2p Maintainers"
    }

  # github_repository_collaborator.this["universal-connectivity:js-libp2p-dev"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "maintain"
      + permission_diff_suppression = false
      + repository                  = "universal-connectivity"
      + username                    = "js-libp2p-dev"
    }

  # github_repository_collaborator.this["universal-connectivity:rust-libp2p maintainers"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "maintain"
      + permission_diff_suppression = false
      + repository                  = "universal-connectivity"
      + username                    = "rust-libp2p Maintainers"
    }

  # github_repository_file.this["universal-connectivity/.github/codeowners"] will be created
  + resource "github_repository_file" "this" {
      + branch              = "main"
      + commit_author       = "GitHub"
      + commit_email        = "noreply@github.com"
      + commit_message      = "chore: Update .github/CODEOWNERS [skip ci]"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            /rust-peer/ @libp2p/rust-libp2p-maintainers
            /go-peer/   @libp2p/go-libp2p-maintainers
            /js-peer/   @libp2p/js-libp2p-dev
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + ref                 = (known after apply)
      + repository          = "universal-connectivity"
      + sha                 = (known after apply)
    }

  # github_repository_file.this["universal-connectivity/codeowners"] will be destroyed
  # (because key ["universal-connectivity/codeowners"] is not in for_each map)
  - resource "github_repository_file" "this" {
      - branch              = "main" -> null
      - commit_author       = "GitHub" -> null
      - commit_email        = "noreply@github.com" -> null
      - commit_message      = "chore: Update CODEOWNERS [skip ci]" -> null
      - commit_sha          = "5e318b8003102cf544caaf7eec4f24f63289fa17" -> null
      - content             = <<-EOT
            rust-peer/* @libp2p/rust-libp2p-maintainers
            go-peer/* @libp2p/go-libp2p-maintainers
            js-peer/* @libp2p/js-libp2p-dev
        EOT -> null
      - file                = "CODEOWNERS" -> null
      - id                  = "universal-connectivity/CODEOWNERS" -> null
      - overwrite_on_create = false -> null
      - ref                 = "main" -> null
      - repository          = "universal-connectivity" -> null
      - sha                 = "faffe4f894f7de6b3456027aac83372838fc3db8" -> null
    }

Plan: 4 to add, 0 to change, 1 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->